leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5516_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef _MPC5516PORTS_H_
#define _MPC5516PORTS_H_

#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_FLEXRAY PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_SPI PORT_FUNC4
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER5 PORT_FUNC5
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER5 PORT_FUNC5
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER5 PORT_FUNC5
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER5 PORT_FUNC5
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER5 PORT_FUNC5
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER4 PORT_FUNC4
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER5 PORT_FUNC5
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER6 PORT_FUNC6
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN PORT_FUNC3
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN PORT_FUNC3
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER2 PORT_FUNC2
