leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5516_portdefs.h
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER2 PORT_FUNC2
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER3 PORT_FUNC3
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_ADC PORT_FUNC1
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER1 PORT_FUNC1
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_ICU PORT_FUNC2

#endif                          /* ifdef _MPC5516PORTS_H */
